tap "hashicorp/tap"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Curses development kit provides predefined curses widget for apps
brew "cdk"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dependency Manager for PHP
brew "composer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Simple terminal UI for git commands
brew "lazygit"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Node.js version manager
brew "nodenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Terraform
brew "hashicorp/tap/terraform"
# Collaboration platform for API development
cask "postman"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/AlexanderGrooff/mermaid-ascii"
go "github.com/matryer/moq"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "honnef.co/go/tools/cmd/staticcheck"
